api/config/web.php

INSERT INTO `log` (`level`, `category`, `prefix`, `log_time`, `message`) VALUES (4, 'api_response', '[]', 1698296577, '{\n    \"success\": false,\n    \"data\": {\n        \"name\": \"Unauthorized\",\n        \"message\": \"Your request was made with invalid credentials.\",\n        \"code\": 0,\n        \"status\": 401,\n        \"type\": \"yii\\\\web\\\\UnauthorizedHttpException\"\n    },\n    \"message\": \"Your request was made with invalid credentials.\",\n    \"status\": 401\n}')
---
                $responseLog->prefix    = '[]';
                $responseLog->log_time  = time();
                $responseLog->message   = json_encode($response->data, JSON_PRETTY_PRINT);
                if (!$responseLog->validate() || !$responseLog->save()) {